/***************************************************************************\
*                                                                           *
* Система информационного обеспечения геофизических исследований скважин    *
*   "ПРАЙМ" для Windows                                                     *
* Интерфейс к визуальному интерпретатору: константы и структуры             *
* Язык: C++                                                                 *
* Версия: 4.06.12                                                           *
* (C) НПФ ГеоТЭК, 1999, 2007                                                *
*                                                                           *
\***************************************************************************/

#ifndef _PRIMEAPI_
#define _PRIMEAPI_
#include <windows.h>
#include "dsapi.h"

#ifdef _MSC_VER
  /* Microsoft Visual C++ */
  #pragma pack( push, ENTER_PRIMEAPI, 1 )
#else
  #ifdef __BORLANDC__
    // Borland C++ or Builder
    #if __BCPLUSPLUS__ > 0x520
      // Builder
      #pragma option push -a1 -VF
    #else
      // Borland C++
      #pragma option -a1 -VF
    #endif
  #else
    /* What else??? */
    #pragma option -a1 -VF
  #endif
#endif

#ifndef _LONGBOOL_
#define _LONGBOOL_
typedef long LongBoolean;
#endif

/* Типы объектов на планшете возвращаемые функцией WSType */
const long wsUnknown       = 0;   /* Тип не принадлежит ни одному из перечисленных */
const long wsViewCurve     = 1;   /* Кривая */
const long wsViewPoint     = 2;   /* Примитив */
const long wsViewInter     = 3;   /* Интервал */
const long wsViewNotes     = 4;   /* Надпись */
const long wsViewTower     = 5;   /* Пустая колонка */
const long wsTowerDepth    = 6;   /* Колонка глубин */
const long wsTowerInter    = 7;   /* Попластовая колонка */
const long wsTowerLnGrid   = 8;   /* Линейная сетка */
const long wsTowerLgGrid   = 9;   /* Логарифимическая сетка */
const long wsTowerRvGrid   = 10;  /* Обратная сетка */
const long wsViewScale     = 11;  /* Шкала */
const long wsViewPicture   = 12;  /* Рисунок на планшете */
const long wsViewTwoDCurve = 14;  /* 2-мерная кривая */
const long wsInterReper    = 100; /* Репер */

#define NormalPut  0    /* Обычный способ вывода  */
#define ANDPut     1    /* Наложение              */
#define ORPut      2    /*       логических       */
#define XORPut     3    /*               операций */
#define TransPut   4    /* Просвечивающимся фоном */


/* Список констант для интерактивного взимодействия с планшетом */
/* Для строки форматирования вывода информации в строке статуса */

/*  0 - Глубина;
1 - Начало;
2 - Значение;
3 - Ширина;
4 - Высота;
5 - Дельта;
6 - Интервал; */

#define tmDepthLine  0x0001 /* Использовать горизонтальную линию */
#define tmStartLine  0x0002 /* Использовать вертикальную линию */
#define tmDepthLimit 0x0004 /* Запретить перемещение по глубине */
#define tmStartLimit 0x0008 /* Запретить перемещение по горизонтали */
#define tmDrawCross  0x0010 /* Рисовать в точке отслеживания крестик */
#define tmDrawLine   0x0020 /* Рисовать линию  от начальной точки до текущей */
#define tmDrawBox    0x0040 /* Рисовать прямоугольник от начальной точки до текущей */
#define tmShowInfo   0x0080 /* Выводить в строке статуса информацию о данной точке */
#define tmStartPoint 0x0100 /* Начать отслеживание с начальной точки */
#define tmWidthLimit 0x0200 /* Обязательно ненулевое значение ширины */
#define tmDeltaLimit 0x0400 /* Обязательно ненулевое значение интервала по глубине */
#define tmDepthRange 0x0800 /* Глубина не должна выходить за указанный интервал */
#define tmKeepMouse  0x1000 /* Не изменять позицию мыши */

/* Маски флагов элемента легенды */
#define lfShowLegend   0x00000001
#define lfShowName     0x00000002
#define lfEqualWidths  0x00000004

/* Маски и количество битов для сдвига флагов общих параметров легенды */
#define lfcShowName    0x00000003
#define lfiShowName    0
#define lfcEqualWidths 0x0000000C
#define lfiEqualWidths 2

extern char *tnPlansheet;
extern char *tnPointTable;
extern char *tnInterTable;
extern char *tnCurveTable;
extern char *tnLitolTable;
extern char *fnMinValue;
extern char *fnMaxValue;
extern char *fnStrValue;
extern char *fnBMPIndex;
extern char *fnBMPName;
extern char *fnBMPWidth;
extern char *fnBMPHeigth;
extern char *fnBMPInvers;
extern char *fnBMPColor;

/* Названия массивов с интервалы в таблице ПРИМИТИВЫ_ИНТЕРВАЛА */
extern char *inPerfProekt;  /* 00 - Интервалы перфорации проектные   */
extern char *inPerfFact;    /* 01 - Интервалы перфорации фактические */
extern char *inIntSostPrit; /* 02 - Интервалы и составы притоков     */
extern char *inPrinInter;   /* 03 - Принимающие интервалы            */
extern char *inMoveFluid;   /* 04 - Интервалы движения жидкости по неперфорированным пластам */
extern char *inMPlPDown;    /* 05 - Интервалы межпластовых перетоков сверху */
extern char *inMPlPUp;      /* 06 - Интервалы межпластовых перетоков снизу */
extern char *inPeretDown;   /* 07 - Интервалы перетоков в остановленной скважине сверху */
extern char *inPeretUp;     /* 08 - Интервалы перетоков в остановленной скважине снизу */
extern char *inZKCDown;     /* 09 - Интервалы заколонной циркуляции сверху */
extern char *inZKCUp;       /* 10 - Интервалы заколонной циркуляции снизу */
extern char *inPatrubok;    /* 11 - Местонахождение патрубка в обсадной колонне */
extern char *inFilterPaker; /* 12 - Местонахождение фильтра пакера */

extern char *pnNegermCol;   /* 00 - */
extern char *pnNegermNKT;   /* 01 - */
extern char *pnIskustZab;   /* 02 - */
extern char *pnMoveFluid;   /* 03 - */
extern char *pnPakerPlace;  /* 04 - */
extern char *pnBaschmExpl;  /* 05 - */
extern char *pnBaschmTech;  /* 06 - */
extern char *pnBaschmStop;  /* 07 - */
extern char *pnBaschmObsd;  /* 08 - */
extern char *pnBaschmNapr;  /* 09 - */
extern char *pnBaschmCond;  /* 10 - */
extern char *pnBaschmNKT;   /* 11 - */

extern char *pnUstDoubleC;  /* 12 - */
extern char *pnStopRound;   /* 13 - */

extern char *pnCementLev;   /* 14 - */
extern char *pnNKTKlapan;   /* 15 - */
extern char *pnRNKTKlapan;  /* 16 - */
extern char *pnDynamycLev;  /* 17 - */
extern char *pnGVR;         /* 18 - */
extern char *pnGNR;         /* 19 - */
extern char *pnNVR;         /* 20 - */
extern char *pnGAS;         /* 21 - */
extern char *pnNAS;         /* 22 - */
extern char *pnNASKlapan;   /* 23 - */
extern char *pnCentrFonar;  /* 24 - */

extern char *fnPointDepth;
extern char *fnGerm;
extern char *fnGermOk;
extern char *fnGermDown;
extern char *fnGermUp;
extern char *fnOilDirect;
extern char *fnOilOut;
extern char *fnOilIn;
extern char *fnOilDown;
extern char *fnOilUp;
extern char *fnOilDownIn;
extern char *fnOilUpIn;
extern char *fnOilOutDown;
extern char *fnOilOutUp;
extern char *fnInterRoof;
extern char *fnInterSole;
extern char *fnWaterCont;
extern char *fnGasContent;
extern char *fnTimeStamp;

extern char *fnMethodName;
extern char *fnMethodUnit;
extern char *fnCurveRoof;
extern char *fnCurveSole;
extern char *fnCurveStep;
extern char *fnCurveValue;
extern char *fnBlankValue;
extern char *fnVersion;
extern char *fnDepthShift;
extern char *fnDepthValue;

extern char *tnProject;
extern char *fnProjectShortName;
extern char *fnProjectDesc;
extern char *anVPTs;

/* Режимы отработки планшетом */
const long hmCurve         = 0;  /* Отрабатываются кривые */
